In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
np.random.seed(1)

In [3]:

df  =  pd.DataFrame(randn(4, 5),[1, 2, 3, 4], ['A', 'B', 'C', 'D', 'E'])
df

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [4]:
df[:1]

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408

In [5]:
df['New'] = df['A'] + df['B']
df

          A         B         C         D         E       New
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408  1.012589
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370 -0.556727
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -0.598033
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815 -1.272319

In [6]:
df.drop('New', axis=1, inplace=True)

In [7]:
df

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [8]:
df.shape

(4, 5)

In [9]:
df[['A', 'B']]

          A         B
1  1.624345 -0.611756
2 -2.301539  1.744812
3  1.462108 -2.060141
4 -1.099891 -0.172428

In [10]:
df.loc[1]

A    1.624345
B   -0.611756
C   -0.528172
D   -1.072969
E    0.865408
Name: 1, dtype: float64

In [11]:
df.iloc[0]

A    1.624345
B   -0.611756
C   -0.528172
D   -1.072969
E    0.865408
Name: 1, dtype: float64

In [12]:
df

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [13]:
df > 0

       A      B      C      D      E
1   True  False  False  False   True
2  False   True  False   True  False
3   True  False  False  False   True
4  False  False  False   True   True

In [14]:
df[df>0]

          A         B   C         D         E
1  1.624345       NaN NaN       NaN  0.865408
2       NaN  1.744812 NaN  0.319039       NaN
3  1.462108       NaN NaN       NaN  1.133769
4       NaN       NaN NaN  0.042214  0.582815

In [15]:
df [df['A']>0]

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769

In [16]:
df [df['A']>0][['B', 'C']]

          B         C
1 -0.611756 -0.528172
3 -2.060141 -0.322417

In [17]:
df

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [18]:
df [(df['A']<0) & (df['D']>0)]

          A         B         C         D         E
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [19]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [20]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [21]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [22]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])
df

             A         B
G1 1 -1.100619  1.144724
   2  0.901591  0.502494
   3  0.900856 -0.683728
G2 1 -0.122890 -0.935769
   2 -0.267888  0.530355
   3 -0.691661 -0.396754

In [23]:
df.index.names = ['Groups', 'Names']

In [24]:
df

                     A         B
Groups Names
G1     1     -1.100619  1.144724
       2      0.901591  0.502494
       3      0.900856 -0.683728
G2     1     -0.122890 -0.935769
       2     -0.267888  0.530355
       3     -0.691661 -0.396754

In [25]:
df.loc['G1'].loc[2]

A    0.901591
B    0.502494
Name: 2, dtype: float64

In [29]:
import pandas as pd
import numpy as np

data = {'Ism': ['Ali', 'Zarina', np.nan, 'Bobur', 'Laylo'],
        'Yosh': [25, np.nan, 22, np.nan, 30],
        'Shahar': ['Toshkent', 'Samarqand', 'Buxoro', np.nan, 'Xiva']}
df = pd.DataFrame(data)

# Yo'qolgan qiymatlarni aniqlash
print(df.isnull())
print('aaa')
# Yo'qolgan qiymatlar sonini hisoblash
print(df.isnull().sum().sum())

     Ism   Yosh  Shahar
0  False  False   False
1  False   True   False
2   True  False   False
3  False   True    True
4  False  False   False
aaa
4

In [38]:
import pandas as pd
import numpy as np

data = {'Ism': ['Ali', 'Zarina', np.nan, 'Bobur', 'Laylo'],
        'Yosh': [25, np.nan, 22, np.nan, 30],
        'Shahar': ['Toshkent', 'Samarqand', 'Buxoro', np.nan, 'Xiva']}
df = pd.DataFrame(data)

# Yo'qolgan qiymatlarni aniqlash
print(df.isnull())

# Yo'qolgan qiymatlar sonini hisoblash
print(df.isnull().sum())

     Ism   Yosh  Shahar
0  False  False   False
1  False   True   False
2   True  False   False
3  False   True    True
4  False  False   False
Ism       1
Yosh      2
Shahar    1
dtype: int64

In [39]:
# Yo'qolgan qiymatlarni 0 bilan to'ldirish
df_filled = df.fillna(0)
print(df_filled)

# Ustundagi o'rtacha qiymat bilan to'ldirish
df['Yosh'] = df['Yosh'].fillna(df['Yosh'].mean())
print(df)

      Ism  Yosh     Shahar
0     Ali  25.0   Toshkent
1  Zarina   0.0  Samarqand
2       0  22.0     Buxoro
3   Bobur   0.0          0
4   Laylo  30.0       Xiva
      Ism       Yosh     Shahar
0     Ali  25.000000   Toshkent
1  Zarina  25.666667  Samarqand
2     NaN  22.000000     Buxoro
3   Bobur  25.666667        NaN
4   Laylo  30.000000       Xiva

In [40]:
# # Yo'qolgan qiymatlarni o'z ichiga olgan qatorlarni olib tashlash
# df_dropped = df.dropna()
# print(df_dropped)

# # Faqat barcha qiymatlar yo'q bo'lgan qatorlarni olib tashlash
# df_dropped_all = df.dropna(how='all')
# print(df_dropped_all)

In [41]:
# Oldingi qiymatlar bilan to'ldirish
df_ffill = df.ffill()
print(df_ffill)

# Keyingi qiymatlar bilan to'ldirish
df_bfill = df.bfill()
print(df_bfill)

      Ism       Yosh     Shahar
0     Ali  25.000000   Toshkent
1  Zarina  25.666667  Samarqand
2  Zarina  22.000000     Buxoro
3   Bobur  25.666667     Buxoro
4   Laylo  30.000000       Xiva
      Ism       Yosh     Shahar
0     Ali  25.000000   Toshkent
1  Zarina  25.666667  Samarqand
2   Bobur  22.000000     Buxoro
3   Bobur  25.666667       Xiva
4   Laylo  30.000000       Xiva